BtmsGatewayStub/Examples/ClearanceRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <soap:Header>
        <oas:Security soap:role="system" soap:mustUnderstand="true">
            <oas:UsernameToken>
                <oas:Username>systemID=ALVSHMRCCDS,ou=gsi systems,o=defra</oas:Username>
                <oas:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</oas:Password>
            </oas:UsernameToken>
        </oas:Security>
    </soap:Header>
    <soap:Body>
        <ALVSClearanceRequest xmlns="http://submitimportdocumenthmrcfacade.types.esb.ws.cara.defra.com">
            <ServiceHeader>
                <SourceSystem>CDS</SourceSystem>
                <DestinationSystem>ALVS</DestinationSystem>
                <CorrelationId>193264645102865</CorrelationId>
                <ServiceCallTimestamp>2022-01-12T14:21:50.286</ServiceCallTimestamp>
            </ServiceHeader>
            <Header>
                <EntryReference>290-000151G-02/01/2022</EntryReference>
                <EntryVersionNumber>3</EntryVersionNumber>
                <PreviousVersionNumber>2</PreviousVersionNumber>
                <DeclarationUCR>1GB116445386000-KDA35932Y1BHX</DeclarationUCR>
                <DeclarationType>S</DeclarationType>
                <ArrivalDateTime>202201031224</ArrivalDateTime>
                <SubmitterTURN>123456789012</SubmitterTURN>
                <DeclarantId>GB123456789013</DeclarantId>
                <DeclarantName>REDACTED</DeclarantName>
                <DispatchCountryCode>CN</DispatchCountryCode>
                <GoodsLocationCode>GBSTN</GoodsLocationCode>
                <MasterUCR>GB/CNS1-SCT16S6LF00000</MasterUCR>
            </Header>
            <Item>
                <ItemNumber>1</ItemNumber>
                <CustomsProcedureCode>4000000</CustomsProcedureCode>
                <TaricCommodityCode>2309105100</TaricCommodityCode>
                <GoodsDescription>DOG CHEW</GoodsDescription>
                <ConsigneeId>GB123456789012</ConsigneeId>
                <ConsigneeName>REDACTED</ConsigneeName>
                <ItemNetMass>5011.200</ItemNetMass>
                <ItemOriginCountryCode>CN</ItemOriginCountryCode>
                <Document><DocumentCode>N853</DocumentCode>
                    <DocumentReference>GBCVD2021.1396392</DocumentReference>
                    <DocumentStatus>AE</DocumentStatus>
                    <DocumentControl>P</DocumentControl>
                </Document>
                <Check>
                    <CheckCode>H222</CheckCode>
                    <DepartmentCode>PHA</DepartmentCode>
                </Check>
            </Item>
            <Item>
                <ItemNumber>2</ItemNumber>
                <CustomsProcedureCode>4000000</CustomsProcedureCode>
                <TaricCommodityCode>2309103300</TaricCommodityCode>
                <GoodsDescription>DOG CHEW</GoodsDescription>
                <ConsigneeId>GB123456789012</ConsigneeId>
                <ConsigneeName>REDACTED</ConsigneeName>
                <ItemNetMass>3198.720</ItemNetMass>
                <ItemOriginCountryCode>CN</ItemOriginCountryCode>
                <Document>
                    <DocumentCode>N853</DocumentCode>
                    <DocumentReference>GBCVD2021.1396392</DocumentReference>
                    <DocumentStatus>AE</DocumentStatus>
                    <DocumentControl>P</DocumentControl>
                </Document>
                <Check>
                    <CheckCode>H222</CheckCode>
                    <DepartmentCode>PHA</DepartmentCode>
                </Check>
            </Item>
            <Item>
                <ItemNumber>3</ItemNumber>
                <CustomsProcedureCode>4000000</CustomsProcedureCode>
                <TaricCommodityCode>2309109000</TaricCommodityCode>
                <GoodsDescription>DOG CHEWS</GoodsDescription>
                <ConsigneeId>GB123456789012</ConsigneeId>
                <ConsigneeName>REDACTED</ConsigneeName>
                <ItemNetMass>144.000</ItemNetMass>
                <ItemOriginCountryCode>CN</ItemOriginCountryCode>
                <Document><DocumentCode>N853</DocumentCode>
                    <DocumentReference>GBCVD2021.1396386</DocumentReference>
                    <DocumentStatus>AE</DocumentStatus>
                    <DocumentControl>P</DocumentControl>
                </Document>
                <Check>
                    <CheckCode>H222</CheckCode>
                    <DepartmentCode>PHA</DepartmentCode>
                </Check>
            </Item>
        </ALVSClearanceRequest>
    </soap:Body>
</soap:Envelope>